zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_reset.h
    kIOPCTL1_RST_SHIFT_RSTn   = (RST_CTL3_PSCCTL0 << 8) | 0U,      /*!< IOPCTL1 reset control */
    kCPU1_RST_SHIFT_RSTn      = (RST_CTL3_PSCCTL0 << 8) | 31U,     /*!< CPU1 reset control */
    kMU0_RST_SHIFT_RSTn       = (RST_CTL3_PSCCTL1 << 8) | 1U,      /*!< MU0 reset control */
    kMU1_RST_SHIFT_RSTn       = (RST_CTL3_PSCCTL1 << 8) | 2U,      /*!< MU1 reset control */
    kMU2_RST_SHIFT_RSTn       = (RST_CTL3_PSCCTL1 << 8) | 3U,      /*!< MU2 reset control */
    kSEMA420_RST_SHIFT_RSTn   = (RST_CTL3_PSCCTL1 << 8) | 5U,      /*!< SEMA42_0 reset control */
    kADC0_RST_SHIFT_RSTn      = (RST_CTL3_PSCCTL1 << 8) | 6U,      /*!< ADC0 reset control */
    kSDADC0_RST_SHIFT_RSTn    = (RST_CTL3_PSCCTL1 << 8) | 7U,      /*!< SDADC0 reset control */
    kACMP0_RST_SHIFT_RSTn     = (RST_CTL3_PSCCTL1 << 8) | 8U,      /*!< ACMP0 reset control */
    kPDM_RST_SHIFT_RSTn       = (RST_CTL3_PSCCTL1 << 8) | 9U,      /*!< MICFIL/PDM reset control */
    kINPUTMUX1_RST_SHIFT_RSTn = (RST_CTL3_PSCCTL1 << 8) | 14U,     /*!< INPUTMUX1 reset control */
    kLPI2C15_RST_SHIFT_RSTn   = (RST_CTL3_PSCCTL1 << 8) | 18U,     /*!< LPI2C15 reset control */

    kVGPU_RST_SHIFT_RSTn          = (RST_CTL4_PSCCTL0 << 8) | 2U,  /*!< VGPU reset control */
    kLCDIF_RST_SHIFT_RSTn         = (RST_CTL4_PSCCTL0 << 8) | 3U,  /*!< LCDIF reset control */
    kMIPI_DSI_CTRL_RST_SHIFT_RSTn = (RST_CTL4_PSCCTL0 << 8) | 4U,  /*!< MIPIDSI reset control */
    kEZHV_RST_SHIFT_RSTn          = (RST_CTL4_PSCCTL0 << 8) | 5U,  /*!< EZHV reset control */
    kJPEGDEC_RST_SHIFT_RSTn       = (RST_CTL4_PSCCTL0 << 8) | 6U,  /*!< JPEGDEC reset control */
    kPNGDEC_RST_SHIFT_RSTn        = (RST_CTL4_PSCCTL0 << 8) | 7U,  /*!< PNGDEC reset control */
    kXSPI2_RST_SHIFT_RSTn         = (RST_CTL4_PSCCTL0 << 8) | 8U,  /*!< XSPI2 and MMU2 reset control */
    kLPSPI14_RST_SHIFT_RSTn       = (RST_CTL4_PSCCTL0 << 8) | 13U, /*!< LPSPI14 reset control */
    kLPSPI16_RST_SHIFT_RSTn       = (RST_CTL4_PSCCTL0 << 8) | 14U, /*!< LPSPI16 reset control */
    kFLEXIO0_RST_SHIFT_RSTn       = (RST_CTL4_PSCCTL0 << 8) | 15U, /*!< FLEXIO0 reset control */

    kUSB0_RST_SHIFT_RSTn    = (RST_CTL4_PSCCTL1 << 8) | 0U,        /*!< USB0 reset control */
    kUSBPHY0_RST_SHIFT_RSTn = (RST_CTL4_PSCCTL1 << 8) | 1U,        /*!< USBPHY0 reset control */
    kUSB1_RST_SHIFT_RSTn    = (RST_CTL4_PSCCTL1 << 8) | 2U,        /*!< USB1 reset control */
    kUSDHC0_RST_SHIFT_RSTn  = (RST_CTL4_PSCCTL1 << 8) | 4U,        /*!< USDHC0 reset control */
    kUSDHC1_RST_SHIFT_RSTn  = (RST_CTL4_PSCCTL1 << 8) | 5U,        /*!< USDHC1 reset control */
} RSTCTL_RSTn_t;

/*! @brief Flash device current running mode. */
enum
{
    kFlashInstMode_ExtendedSpi = 0x0U,
    kFlashInstMode_0_4_4_SDR   = 0x1U,
    kFlashInstMode_0_4_4_DDR   = 0x2U,
    kFlashInstMode_DPI_SDR     = 0x21U,
    kFlashInstMode_DPI_DDR     = 0x22U,
    kFlashInstMode_QPI_SDR     = 0x41U,
    kFlashInstMode_QPI_DDR     = 0x42U,
    kFlashInstMode_OPI_SDR     = 0x81U,
    kFlashInstMode_OPI_DDR     = 0x82U,
};

/*! @brief flash reset sequence of standard SPI mode. */
enum
{
    kRestoreSeqence_None             = 0U,
    kRestoreSeqence_QPI_4_0xFFs      = 2U,
    kRestoreSeqence_QPI_Mode_0x00    = 3U,
    kRestoreSeqence_Send_F0          = 5U,
    kRestoreSeqence_Send_66_99       = 6U,
    kRestoreSeqence_Send_6699_9966   = 7U,
    kRestoreSeqence_Send_06_FF       = 8U,
    kRestoreSeqence_QPI_5_0xFFs      = 9U,
    kRestoreSeqence_Send_QPI_8_0xFFs = 10U,
    kRestoreSeqence_Wakep_0xAB       = 11U,
    kRestoreSeqence_Wakep_0xAB_54    = 12U,
};

/*!
 * @brief Flash context
 *
 * Defines the flash context parameter used by ROM.
 */
typedef union _FLASH_run_context_t
{
    struct
    {
        uint8_t reseverd0;        /*!< Reserved. */
        uint8_t current_mode;     /*!< Flash device current running mode. */
        uint8_t reserved1;        /*!< Reserved. */ 
        uint8_t restore_sequence; /*!< Flash reset sequence of standard SPI mode. */
    } B;
    uint32_t U;
} FLASH_run_context_t;

/** Array initializers with peripheral reset bits **/
#define ADC_RSTS             \
    {                        \
        kADC0_RST_SHIFT_RSTn \
    } /* Reset bits for ADC peripheral */
#define SDADC_RSTS             \
    {                          \
        kSDADC0_RST_SHIFT_RSTn \
    } /* Reset bits for SDADC peripheral */
#define CRC_RSTS             \
    {                        \
        kCRC0_RST_SHIFT_RSTn \
    } /* Reset bits for CRC peripheral */
#define CTIMER_RSTS                                                                                            \
    {                                                                                                          \
        kCTIMER0_RST_SHIFT_RSTn, kCTIMER1_RST_SHIFT_RSTn, kCTIMER2_RST_SHIFT_RSTn, kCTIMER3_RST_SHIFT_RSTn,    \
            kCTIMER4_RST_SHIFT_RSTn, kCTIMER5_RST_SHIFT_RSTn, kCTIMER6_RST_SHIFT_RSTn, kCTIMER7_RST_SHIFT_RSTn \
    } /* Reset bits for TIMER peripheral */
#define MIPI_DSI_RSTS                 \
    {                                 \
        kMIPI_DSI_CTRL_RST_SHIFT_RSTn \
    } /* Reset bits for MIPI_DSI peripheral */
#define LCDIF_RSTS            \
    {                         \
        kLCDIF_RST_SHIFT_RSTn \
    } /* Reset bits for LCDIF peripheral */
#define LP_FLEXCOMM_RSTS                                                                                               \
    {                                                                                                                  \
        kFC0_RST_SHIFT_RSTn, kFC1_RST_SHIFT_RSTn, kFC2_RST_SHIFT_RSTn, kFC3_RST_SHIFT_RSTn, kFC4_RST_SHIFT_RSTn,       \
            kFC5_RST_SHIFT_RSTn, kFC6_RST_SHIFT_RSTn, kFC7_RST_SHIFT_RSTn, kFC8_RST_SHIFT_RSTn, kFC9_RST_SHIFT_RSTn,   \
            kFC10_RST_SHIFT_RSTn, kFC11_RST_SHIFT_RSTn, kFC12_RST_SHIFT_RSTn, kFC13_RST_SHIFT_RSTn, (RSTCTL_RSTn_t)0U, \
            (RSTCTL_RSTn_t)0U, (RSTCTL_RSTn_t)0U, kFC17_RST_SHIFT_RSTn, kFC18_RST_SHIFT_RSTn, kFC19_RST_SHIFT_RSTn,    \
            kFC20_RST_SHIFT_RSTn                                                                                       \
    } /* Reset bits for FLEXCOMM peripheral */
#define FLEXIO_RSTS             \
    {                           \
        kFLEXIO0_RST_SHIFT_RSTn \
    } /* Resets bits for FLEXIO peripheral */
#define FREQME_RSTS_N          \
    {                          \
        kFREQME_RST_SHIFT_RSTn \
    } /* Resets bits for FREQME0 peripheral */
#define XSPI_RSTS                                                           \
    {                                                                       \
        kXSPI0_RST_SHIFT_RSTn, kXSPI1_RST_SHIFT_RSTn, kXSPI2_RST_SHIFT_RSTn \
    } /* Resets bits for FLEXSPI peripheral */
#define GPIO_RSTS                                                                                        \
    {                                                                                                    \
        kGPIO0_RST_SHIFT_RSTn, kGPIO1_RST_SHIFT_RSTn, kGPIO2_RST_SHIFT_RSTn, kGPIO3_RST_SHIFT_RSTn,      \
            kGPIO4_RST_SHIFT_RSTn, kGPIO5_RST_SHIFT_RSTn, kGPIO6_RST_SHIFT_RSTn, kGPIO7_RST_SHIFT_RSTn,  \
            kGPIO8_RST_SHIFT_RSTn, kGPIO9_RST_SHIFT_RSTn, kGPIO10_RST_SHIFT_RSTn, kGPIO0_RST_SHIFT_RSTn, \
            kGPIO1_RST_SHIFT_RSTn, kGPIO2_RST_SHIFT_RSTn, kGPIO3_RST_SHIFT_RSTn, kGPIO4_RST_SHIFT_RSTn,  \
            kGPIO5_RST_SHIFT_RSTn, kGPIO6_RST_SHIFT_RSTn, kGPIO7_RST_SHIFT_RSTn, kGPIO8_RST_SHIFT_RSTn,  \
            kGPIO9_RST_SHIFT_RSTn, kGPIO10_RST_SHIFT_RSTn                                                \
    } /* Reset bits for GPIO peripheral */
#define I3C_RSTS                                                                               \
    {                                                                                          \
        kI3C0_RST_SHIFT_RSTn, kI3C1_RST_SHIFT_RSTn, kI3C2_RST_SHIFT_RSTn, kI3C3_RST_SHIFT_RSTn \
    } /* Reset bits for I3C peripheral */

#if defined(FSL_RESET_DRIVER_SENSE)
#define INPUTMUX_RSTS             \
    {                             \
        kINPUTMUX1_RST_SHIFT_RSTn \
    } /* Reset bits for INPUTMUX peripheral */
#define DMA_RSTS_N                                 \
    {                                              \
        kDMA2_RST_SHIFT_RSTn, kDMA3_RST_SHIFT_RSTn \
    } /* Reset bits for DMA peripheral */
#endif
#if defined(FSL_RESET_DRIVER_COMPUTE)
#define INPUTMUX_RSTS             \
    {                             \
        kINPUTMUX0_RST_SHIFT_RSTn \
    } /* Reset bits for INPUTMUX peripheral */
#define DMA_RSTS_N                                 \
    {                                              \
        kDMA0_RST_SHIFT_RSTn, kDMA1_RST_SHIFT_RSTn \
    } /* Reset bits for DMA peripheral */
#endif
#define MRT_RSTS                                   \
    {                                              \
        kMRT0_RST_SHIFT_RSTn, kMRT1_RST_SHIFT_RSTn \
    } /* Reset bits for MRT peripheral */
#if (defined(MIMXRT798S_cm33_core0_SERIES) || defined(MIMXRT758S_cm33_core0_SERIES) || \
     defined(MIMXRT735S_cm33_core0_SERIES))
#define MU_RSTS                                                       \
    {                                                                 \
        kMU0_RST_SHIFT_RSTn, kMU1_RST_SHIFT_RSTn, kMU4_RST_SHIFT_RSTn \
    } /* Reset bits for MU peripheral */
#elif (defined(MIMXRT798S_cm33_core1_SERIES) || defined(MIMXRT758S_cm33_core1_SERIES) || \
       defined(MIMXRT735S_cm33_core1_SERIES))
#define MU_RSTS                                                       \
    {                                                                 \
        kMU1_RST_SHIFT_RSTn, kMU2_RST_SHIFT_RSTn, kMU3_RST_SHIFT_RSTn \
    } /* Reset bits for MU peripheral */
#elif defined(MIMXRT798S_hifi4_SERIES)
#define MU_RSTS                                  \
    {                                            \
        kMU2_RST_SHIFT_RSTn, kMU4_RST_SHIFT_RSTn \
    } /* Reset bits for MU peripheral */
#elif defined(MIMXRT798S_hifi1_SERIES)
#define MU_RSTS                                  \
    {                                            \
        kMU0_RST_SHIFT_RSTn, kMU3_RST_SHIFT_RSTn \
    } /* Reset bits for MU peripheral */
#elif defined(MIMXRT798S_ezhv_SERIES)
#else
#error "Unsupported core!"
#endif

