zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/drivers/fsl_reset.h
#define PINT_RSTS            \
    {                        \
        kPINT_RST_SHIFT_RSTn \
    } /* Reset bits for PINT peripheral */

#define PNGDEC_RSTS            \
    {                          \
        kPNGDEC_RST_SHIFT_RSTn \
    } /* Reset bits for PNGDEC peripheral */

#define JPEGDEC_RSTS            \
    {                           \
        kJPEGDEC_RST_SHIFT_RSTn \
    } /* Reset bits for JPEGDEC peripheral */

#define SCT_RSTS             \
    {                        \
        kSCT0_RST_SHIFT_RSTn \
    } /* Reset bits for SCT peripheral */
#define SEMA42_RSTS                                                                             \
    {                                                                                           \
        kSEMA420_RST_SHIFT_RSTn, (RSTCTL_RSTn_t)0U, (RSTCTL_RSTn_t)0U, kSEMA423_RST_SHIFT_RSTn, \
            kSEMA424_RST_SHIFT_RSTn                                                             \
    } /* Reset bits for SEMA42 peripheral */
#define SAI_RSTS                                                                               \
    {                                                                                          \
        kSAI0_RST_SHIFT_RSTn, kSAI1_RST_SHIFT_RSTn, kSAI2_RST_SHIFT_RSTn, kSAI3_RST_SHIFT_RSTn \
    } /* Reset bits for SAI peripheral */
#define USDHC_RSTS                                     \
    {                                                  \
        kUSDHC0_RST_SHIFT_RSTn, kUSDHC1_RST_SHIFT_RSTn \
    } /* Reset bits for USDHC peripheral */
#define UTICK_RSTS                                     \
    {                                                  \
        kUTICK0_RST_SHIFT_RSTn, kUTICK1_RST_SHIFT_RSTn \
    } /* Reset bits for UTICK peripheral */

/*!
 * @brief IP reset handle
 */
typedef RSTCTL_RSTn_t reset_ip_name_t;

/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Assert reset to peripheral.
 *
 * Asserts reset signal to specified peripheral module.
 *
 * @param peripheral Assert reset to this peripheral. The enum argument contains encoding of reset register
 *                   and reset bit position in the reset register.
 */
void RESET_SetPeripheralReset(reset_ip_name_t peripheral);

/*!
 * @brief Clear reset to peripheral.
 *
 * Clears reset signal to specified peripheral module, allows it to operate.
 *
 * @param peripheral Clear reset to this peripheral. The enum argument contains encoding of reset register
 *                   and reset bit position in the reset register.
 */
void RESET_ClearPeripheralReset(reset_ip_name_t peripheral);

/*!
 * @brief Reset peripheral module.
 *
 * Reset peripheral module.
 *
 * @param peripheral Peripheral to reset. The enum argument contains encoding of reset register
 *                   and reset bit position in the reset register.
 */
void RESET_PeripheralReset(reset_ip_name_t peripheral);

/*!
 * @brief Release peripheral module.
 *
 * Release peripheral module.
 *
 * @param peripheral Peripheral to release. The enum argument contains encoding of reset register
 *                   and reset bit position in the reset register.
 */
static inline void RESET_ReleasePeripheralReset(reset_ip_name_t peripheral)
{
    RESET_ClearPeripheralReset(peripheral);
}

/*!
 * @brief Gets the reset source status which caused a previous reset.
 *
 * This function gets the status of the latest reset event. Use source masks
 * defined in the rstctl_reset_source_t to get the desired source status.
 *
 * @return All reset source status bit map.
 */
static inline uint32_t RESET_GetPreviousResetSources(void)
{
    return RSTCTL3->SYSRSTSTAT;
}

/*!
 * @brief Clears the reset source status.
 *
 * This function clears the system reset flags indicated by source masks.
 *
 * @param sourceMasks reset source status bit map
 */
static inline void RESET_ClearResetSources(uint32_t sourceMasks)
{
    RSTCTL3->SYSRSTSTAT = sourceMasks;
}

/*!
 * @brief Gets the reset status of domains.
 *
 * This function gets the reset status of domains.
 *
 * @return All reset source status bit map.
 */
static inline uint32_t RESET_GetDomainResetStatus(void)
{
    return RSTCTL3->DOMRSTSTAT;
}

#if defined(FSL_RESET_DRIVER_COMPUTE)

/*!
 * @brief Set flash state context register used by ROM.
 *
 * During flash boot, the ROM requires the flash memory device to be in 1-bit
 * SPI compatible mode. The boot process requires special processing to restore
 * the flash device if it was changed by application. The flash state context
 * can be used by ROM to reset the flash to default working mode.
 * @code
 *     FLASH_run_context_t run_ctx = {.U = 0 };
 *     // Set the current FLASH mode
 *     run_ctx.B.current_mode = kFlashInstMode_OPI_DDR;
 *     // Select the FLASH reset sequences
 *     run_ctx.B.restore_sequence = kRestoreSeqence_Send_6699_9966;
 *     RESET_SetFlashStateContext(run_ctx.U) // Update the context register
 * @endcode
 *
 * @param context Flash state context defined by @ref FLASH_run_context_t.
 */
static inline void RESET_SetFlashStateContext(uint32_t context)
{
    RTC0->GPR = context;
}
#endif

#if defined(__cplusplus)
}
#endif

/*! @} */

#endif /* FSL_RESET_H_ */
